In [1]:
import pandas as pd
import numpy as np

# Creando un DataFrame

In [132]:
df = pd.read_csv('../Mastermind/mastermind.csv') #Por temas de doocumentación se asocia df a dataframe

In [133]:
df

   Unnamed: 0          nombre         especialidad  edad  visitas sexo
0           0       SFDX Show             Hardware    30   130855    H
1           1     Sara Nogark     Edición de vídeo    29   114175    M
2           2    Nate Gentile         Programación    31   142545    H
3           3       Bettatech         Programación    31   149462    H
4           4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5           5      Edgar Pons             Robótica    29   143620    H
6           6         s4vitar              Hacking    28   132567    H

Como podemos ver, nos genera por defecto una columna al principio de la izquierda pero nosotros ya contamos en el caso de este dataset csv con una columna indice, así que le podemos indicar cual queremos que sea el indice de la siguiente manera:

In [134]:
df = pd.read_csv('../Mastermind/mastermind.csv', index_col=[0]) 
# aquí al indicarle el 0, le tratamos de decir que agarre la primera columna
#Otra manera sería con nombre de la columna, un ejemplo es este:

# df = pd.read_csv('../Mastermind/mastermind.csv', index_col="nombre")

In [135]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

 Pandas asocia cada columna como un array, por ende podemos manipularlas y acceder a ellas

In [136]:
df["especialidad"]

0               Hardware
1       Edición de vídeo
2           Programación
3           Programación
4    Sistemas Operativos
5               Robótica
6                Hacking
Name: especialidad, dtype: object

Aquí podemos ver que el tipo de la columna a como está asociada a panda

In [137]:
type(df["especialidad"])

pandas.core.series.Series

Desde un diccionario

Aquí estamos poniendolo como lista para ver cómo mostrar la lista directa, no como arriba con el puro data

In [138]:
list(df["especialidad"])

['Hardware',
 'Edición de vídeo',
 'Programación',
 'Programación',
 'Sistemas Operativos',
 'Robótica',
 'Hacking']

In [139]:
#recuerda que puedes saber lo largo con len
len(list(df["especialidad"]))

7

In [140]:
datos = {"nombre": ["SDFX Show", "Sara Nogark", "Nate Gentille", "Bettatech", "Antonio Sarosi", "Edfar Pons",
        "s4vitar"],
         "especialidad": list(df["especialidad"]),
         "edad": [np.random.randint(28, 31) for i in range(len(df["nombre"]))],
         "visitas": [np.random.randint(100000, 150000) for i in range(len(df["nombre"]))]
        }

In [141]:
df_inventado = pd.DataFrame(datos)
#Aquí andamos asignando esos datos desde un diccionario como data frame

In [142]:
df_inventado

           nombre         especialidad  edad  visitas
0       SDFX Show             Hardware    28   107541
1     Sara Nogark     Edición de vídeo    28   104190
2   Nate Gentille         Programación    29   129386
3       Bettatech         Programación    28   114324
4  Antonio Sarosi  Sistemas Operativos    30   127316
5      Edfar Pons             Robótica    29   145983
6         s4vitar              Hacking    28   123350

In [143]:
df_inventado["sexo"] = ["H", "M", "H", "H", "H", "H", "H"]

In [144]:
df_inventado

           nombre         especialidad  edad  visitas sexo
0       SDFX Show             Hardware    28   107541    H
1     Sara Nogark     Edición de vídeo    28   104190    M
2   Nate Gentille         Programación    29   129386    H
3       Bettatech         Programación    28   114324    H
4  Antonio Sarosi  Sistemas Operativos    30   127316    H
5      Edfar Pons             Robótica    29   145983    H
6         s4vitar              Hacking    28   123350    H

Como vimos, pudimos añadirle una columna aparte nosotros al data frame ya creado

# Explorando un DataFrame

In [145]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

## df.head()

Este nos trae los primeros valores, podemos igual indicarle cuantos queremos

In [146]:
df.head()

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H

In [147]:
df.head(2)

        nombre      especialidad  edad  visitas sexo
0    SFDX Show          Hardware    30   130855    H
1  Sara Nogark  Edición de vídeo    29   114175    M

## df.tail()

Este nos trae los ultimos valores, podemos igual indicarle cuantos queremos

In [148]:
df.tail()

           nombre         especialidad  edad  visitas sexo
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [149]:
df.tail(2)

       nombre especialidad  edad  visitas sexo
5  Edgar Pons     Robótica    29   143620    H
6     s4vitar      Hacking    28   132567    H

## df.sample()

Este nos trae un parametro de muestra, solo para ver cómo es la data, podemos igual indicarle cuantos queremos

In [150]:
df.sample()

      nombre  especialidad  edad  visitas sexo
3  Bettatech  Programación    31   149462    H

In [151]:
df.sample(2)

       nombre  especialidad  edad  visitas sexo
3   Bettatech  Programación    31   149462    H
5  Edgar Pons      Robótica    29   143620    H

## df.info()

Nos da un resumen de nuestro dataset

In [152]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   nombre        7 non-null      object
 1   especialidad  7 non-null      object
 2   edad          7 non-null      int64
 3   visitas       7 non-null      int64
 4   sexo          7 non-null      object
dtypes: int64(2), object(3)
memory usage: 336.0+ bytes

## df.describe()

 Nos da info de de los valores numericos que tenemos

In [153]:
df.describe()

            edad        visitas
count   7.000000       7.000000
mean   29.428571  135033.142857
std     1.272418   11590.990631
min    28.000000  114175.000000
25%    28.500000  131431.500000
50%    29.000000  132567.000000
75%    30.500000  143082.500000
max    31.000000  149462.000000

Aquí podemos detallar en donde quiero que busque exactamente

In [154]:
df.describe()["edad"]["max"]

31.0

## df.shape

Mostrandonos la forma del data frame

In [155]:
df.shape

(7, 5)

## df.columns

Con esto podemos acceder a las columnas y a su vez modificarlas

In [156]:
df.sample()

      nombre  especialidad  edad  visitas sexo
3  Bettatech  Programación    31   149462    H

In [157]:
df.columns = ["nombre", "especialidad", "viejo", "visitas", "sexo"]
#aquí cambiamos la columna edad por viejo
#Recuerda quitar las columnas que no te sirvan, o terminará saliendote error por no coincidir el tamaño

In [158]:
df.columns = ["nombre", "especialidad", "edad", "visitas", "sexo"]

In [159]:
df.columns

Index(['nombre', 'especialidad', 'edad', 'visitas', 'sexo'], dtype='object')

## df.index

In [160]:
df.index

Int64Index([0, 1, 2, 3, 4, 5, 6], dtype='int64')

# Selección de elementos (Subset)

## Acceso mediante etiquetas

In [161]:
df.head()

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H

Queremos saber la especialidad de Nate, ¿cómo le haríamos?

In [162]:
df["especialidad"][2]

'Programación'

Bien, pero esto es suponiendo que sabemos el indice, pero si tenemos un data frame de muuuchas filas, habrá de hacer otra cosa, por ejemplo:

In [163]:
df["nombre"] == "Nate Gentile" #Bien, con esto sabes como encontrar el indice

0    False
1    False
2     True
3    False
4    False
5    False
6    False
Name: nombre, dtype: bool

In [164]:
df[df["nombre"] == "Nate Gentile"] #Aquí ya estamos trayendo el df que cumple con el requisito

         nombre  especialidad  edad  visitas sexo
2  Nate Gentile  Programación    31   142545    H

In [165]:
df[ df["nombre"] == "Nate Gentile"] ["especialidad"] #Aquí solo lo que busco

2    Programación
Name: especialidad, dtype: object

Aquí más ejemplos de cómo jalaría

In [166]:
df[ df["edad"] == 29]

        nombre      especialidad  edad  visitas sexo
1  Sara Nogark  Edición de vídeo    29   114175    M
5   Edgar Pons          Robótica    29   143620    H

In [167]:
df[ df["edad"] == 29] ["nombre"]

1    Sara Nogark
5     Edgar Pons
Name: nombre, dtype: object

df[columna][fila]

In [168]:
mas_viejos = df[df["edad"] == 31] ["nombre"]

In [169]:
mas_viejos

2    Nate Gentile
3       Bettatech
Name: nombre, dtype: object

## df.iloc[]

df.iloc[indice_fila,indice_columna]

In [170]:
df.head(5)

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H

In [171]:
df.iloc[0,0]

'SFDX Show'

In [172]:
df.iloc[3,2]

31

Aquí estamos iterando par poder pedir que nos traiga un rango de columnas de una misma fila

In [173]:
df.iloc[2,0:2]

nombre          Nate Gentile
especialidad    Programación
Name: 2, dtype: object

## df.loc

df.loc[etiqueta_indice, etiqueta_columna]

Este se trata como un tipo hermano de iloc

In [174]:
df.head()

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H

In [175]:
df.loc[2, "especialidad"]

'Programación'

aquí le estoy pidiendo el rango de lo que necesito

In [176]:
df.loc[2, "especialidad":"visitas"]

especialidad    Programación
edad                      31
visitas               142545
Name: 2, dtype: object

Si pones los 2 puntos pero no le dejas nada dicho, entenderá que quieres desde lo que marcaste inicio hasta el final

In [177]:
df.loc[2, "especialidad":]

especialidad    Programación
edad                      31
visitas               142545
sexo                       H
Name: 2, dtype: object

De igual manera al revés, si poner los dos puntos sin nada y luego el final, te traerá desde el principio hasta ese limite

In [178]:
df.loc[2, : "edad"]

nombre          Nate Gentile
especialidad    Programación
edad                      31
Name: 2, dtype: object

Aquí estamos comparando si estamos realizando lo mismo y en efecto, es lo mismo

In [179]:
df.iloc[2,0:2] == df.loc[2, "nombre" : "especialidad"]

nombre          True
especialidad    True
Name: 2, dtype: bool

# Manipulación de Datos

## Cambiar Indice

### df.set_index()

In [180]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

Aquí lo que hemos hecho es cambiar el indice, ya no queremos que sea numerico, ahora queremos que sea por nnombre

In [181]:
df.set_index("nombre")

                       especialidad  edad  visitas sexo
nombre
SFDX Show                  Hardware    30   130855    H
Sara Nogark        Edición de vídeo    29   114175    M
Nate Gentile           Programación    31   142545    H
Bettatech              Programación    31   149462    H
Antonio Sarosi  Sistemas Operativos    28   132008    H
Edgar Pons                 Robótica    29   143620    H
s4vitar                     Hacking    28   132567    H

In [182]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

Pero OH! que ha pasado, hemos quitado el indice numerico, por alguna extraña razón si lo vuelvo a traer no me trae con el indice modificado spoiler, es una medidad de seguridad de pandas

De esta manera sería la forma correcta de modificar el dataframe, la cual es recreando un data frame nuevo

In [183]:
df_nuevo = df.set_index("edad")

In [184]:
df_nuevo

              nombre         especialidad  visitas sexo
edad
30         SFDX Show             Hardware   130855    H
29       Sara Nogark     Edición de vídeo   114175    M
31      Nate Gentile         Programación   142545    H
31         Bettatech         Programación   149462    H
28    Antonio Sarosi  Sistemas Operativos   132008    H
29        Edgar Pons             Robótica   143620    H
28           s4vitar              Hacking   132567    H

Hay una manera, que es con un parametro, pero esto es peligroso ya que debes estar seguro de que vas a modificar el dataframe, no existe el ctr + Z en estas cosas

In [185]:
df.set_index("nombre", inplace=True)

In [186]:
df

                       especialidad  edad  visitas sexo
nombre
SFDX Show                  Hardware    30   130855    H
Sara Nogark        Edición de vídeo    29   114175    M
Nate Gentile           Programación    31   142545    H
Bettatech              Programación    31   149462    H
Antonio Sarosi  Sistemas Operativos    28   132008    H
Edgar Pons                 Robótica    29   143620    H
s4vitar                     Hacking    28   132567    H

En este caso ya lo hiciste, has realizado el cambio permanente en un data frame, pero claro si por error lo hiciste o te arrepientes, hay una manera de regresar

In [187]:
df.reset_index(inplace = True)

In [188]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [189]:
df_nuevo = df.set_index("nombre")
#Aquí no es necesario en inplace porque ya estoy creando un df nuevo a partir de lo que indiqué

In [190]:
df_nuevo.head()

                       especialidad  edad  visitas sexo
nombre
SFDX Show                  Hardware    30   130855    H
Sara Nogark        Edición de vídeo    29   114175    M
Nate Gentile           Programación    31   142545    H
Bettatech              Programación    31   149462    H
Antonio Sarosi  Sistemas Operativos    28   132008    H

In [191]:
df_nuevo.loc["Nate Gentile", "visitas"]

142545

In [192]:
df_nuevo.loc[["Nate Gentile", "s4vitar"],  ["edad", "visitas"]]

              edad  visitas
nombre
Nate Gentile    31   142545
s4vitar         28   132567

## df.apply()

Podemos mandar llamar todas las columnas que cumplan, por ejemplo traerme todas las que cumplen al ser numericas

In [193]:
df.select_dtypes(include="int64")

   edad  visitas
0    30   130855
1    29   114175
2    31   142545
3    31   149462
4    28   132008
5    29   143620
6    28   132567

Y ya con el apply podemos hacer que les haga algo, por ejemplo sacarle raíz

In [194]:
df.select_dtypes(include="int64").apply(np.sqrt)

       edad     visitas
0  5.477226  361.738856
1  5.385165  337.897914
2  5.567764  377.551321
3  5.567764  386.603156
4  5.291503  363.329052
5  5.385165  378.972295
6  5.291503  364.097514

Aquí aplicaremos una función lambda al conjunto

In [195]:
df["especialidad"]

0               Hardware
1       Edición de vídeo
2           Programación
3           Programación
4    Sistemas Operativos
5               Robótica
6                Hacking
Name: especialidad, dtype: object

Recordando Lamba functions

In [196]:
n = np.array(list(range(5)))

In [197]:
n

array([0, 1, 2, 3, 4])

In [198]:
mas_1 = lambda x: x+1

In [199]:
mas_1(n)

array([1, 2, 3, 4, 5])

Ahora si vamos con lo que queremos aplicar

In [200]:
df["especialidad"].apply(lambda x: x.upper())

0               HARDWARE
1       EDICIÓN DE VÍDEO
2           PROGRAMACIÓN
3           PROGRAMACIÓN
4    SISTEMAS OPERATIVOS
5               ROBÓTICA
6                HACKING
Name: especialidad, dtype: object

Que lo que hicimos fue hacerle upper a todo los valores de esa columna, pero recuerda que al ser manipulación de datos, los datos no cambian permanentemente

In [201]:
df["especialidad mayus"] = df["especialidad"].apply(lambda x: x.upper())

In [202]:
df

,nombre,especialidad,edad,visitas,sexo,especialidad mayus
0,SFDX Show,Hardware,30,130855,H,HARDWARE
1,Sara Nogark,Edición de vídeo,29,114175,M,EDICIÓN DE VÍDEO
2,Nate Gentile,Programación,31,142545,H,PROGRAMACIÓN
3,Bettatech,Programación,31,149462,H,PROGRAMACIÓN
4,Antonio Sarosi,Sistemas Operativos,28,132008,H,SISTEMAS OPERATIVOS
5,Edgar Pons,Robótica,29,143620,H,ROBÓTICA
6,s4vitar,Hacking,28,132567,H,HACKING

En caso de querer sobrescribir, sería declararla como una nueva y darle el valor

In [203]:
df["especialidad"] = df["especialidad"].apply(lambda x: x.upper())

In [204]:
df

,nombre,especialidad,edad,visitas,sexo,especialidad mayus
0,SFDX Show,HARDWARE,30,130855,H,HARDWARE
1,Sara Nogark,EDICIÓN DE VÍDEO,29,114175,M,EDICIÓN DE VÍDEO
2,Nate Gentile,PROGRAMACIÓN,31,142545,H,PROGRAMACIÓN
3,Bettatech,PROGRAMACIÓN,31,149462,H,PROGRAMACIÓN
4,Antonio Sarosi,SISTEMAS OPERATIVOS,28,132008,H,SISTEMAS OPERATIVOS
5,Edgar Pons,ROBÓTICA,29,143620,H,ROBÓTICA
6,s4vitar,HACKING,28,132567,H,HACKING

¡Pero rayos! por mostrar el ejemplo de sobreescribir lo sobreescribí, deseo volver a como lo tenía, no hay problema, sería con el siguiente comando

In [205]:
df["especialidad"] = df["especialidad"].apply(lambda x: x.title())

In [206]:
df

,nombre,especialidad,edad,visitas,sexo,especialidad mayus
0,SFDX Show,Hardware,30,130855,H,HARDWARE
1,Sara Nogark,Edición De Vídeo,29,114175,M,EDICIÓN DE VÍDEO
2,Nate Gentile,Programación,31,142545,H,PROGRAMACIÓN
3,Bettatech,Programación,31,149462,H,PROGRAMACIÓN
4,Antonio Sarosi,Sistemas Operativos,28,132008,H,SISTEMAS OPERATIVOS
5,Edgar Pons,Robótica,29,143620,H,ROBÓTICA
6,s4vitar,Hacking,28,132567,H,HACKING

Pero bueno, ahora queremos quitar la columna que no nos interesa, veremos...

## df.drop()

In [207]:
df.drop("especialidad mayus", inplace =True, axis=1)

#IMPORTANTE axis 0 es filas, axis 1 es columna

In [208]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición De Vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

## df.drop_duplciate()

Esto es como su nombre lo indica, para eliminar duplicados, peeero en caso de tener miedo porque podemos liarla, debemos seguir los siguientes pasos

In [90]:
new_df = df.copy()
#Crear primero una copia de nuestro dataframe

In [91]:
new_df.drop_duplicates("edad")
#OJO esto solo me mantiene los primeros valores que vió, podemos pedirle que mantenga los ultimos

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición De Vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H

In [92]:
new_df.drop_duplicates("edad", keep= "last")

       nombre  especialidad  edad  visitas sexo
0   SFDX Show      Hardware    30   130855    H
3   Bettatech  Programación    31   149462    H
5  Edgar Pons      Robótica    29   143620    H
6     s4vitar       Hacking    28   132567    H

## df.nlargest()

Aquí podemos decirle que nos traiga los valores más altos, y podemos pedirle que nos los traiga ordenados

In [93]:
df.nlargest(len(df), "visitas")

           nombre         especialidad  edad  visitas sexo
3       Bettatech         Programación    31   149462    H
5      Edgar Pons             Robótica    29   143620    H
2    Nate Gentile         Programación    31   142545    H
6         s4vitar              Hacking    28   132567    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición De Vídeo    29   114175    M

## df.sort_values()

Este por defecto te lo trae de manera ascendente

In [94]:
df.sort_values(by="visitas")

           nombre         especialidad  edad  visitas sexo
1     Sara Nogark     Edición De Vídeo    29   114175    M
0       SFDX Show             Hardware    30   130855    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
6         s4vitar              Hacking    28   132567    H
2    Nate Gentile         Programación    31   142545    H
5      Edgar Pons             Robótica    29   143620    H
3       Bettatech         Programación    31   149462    H

Lo puedes mandar pedir de manera decendente

In [95]:
df.sort_values(by="visitas", ascending = False)

           nombre         especialidad  edad  visitas sexo
3       Bettatech         Programación    31   149462    H
5      Edgar Pons             Robótica    29   143620    H
2    Nate Gentile         Programación    31   142545    H
6         s4vitar              Hacking    28   132567    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición De Vídeo    29   114175    M

Podemos mandarle hablar de a varios valores en lugar de solo uno mora

In [98]:
df.sort_values(by=["edad", "visitas"], ascending = False)

           nombre         especialidad  edad  visitas sexo
3       Bettatech         Programación    31   149462    H
2    Nate Gentile         Programación    31   142545    H
0       SFDX Show             Hardware    30   130855    H
5      Edgar Pons             Robótica    29   143620    H
1     Sara Nogark     Edición De Vídeo    29   114175    M
6         s4vitar              Hacking    28   132567    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H

Aquí te está ordenando por edad, y dentro de la edad te los ordena por visitas, para tener las visitas de manera descendiente dentro de la edad de cada uno

## df.nsmallest()

Aquí puedes hacerlo invertido al largest, lo cual es mandarle pedir de manera ascendente

In [96]:
df.nsmallest(len(df), "visitas")

           nombre         especialidad  edad  visitas sexo
1     Sara Nogark     Edición De Vídeo    29   114175    M
0       SFDX Show             Hardware    30   130855    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
6         s4vitar              Hacking    28   132567    H
2    Nate Gentile         Programación    31   142545    H
5      Edgar Pons             Robótica    29   143620    H
3       Bettatech         Programación    31   149462    H

Como puedes darte cuenta, es exactamente lo mismo que sortearlo con sortvalues, mira

In [97]:
df.nsmallest(len(df), "visitas") == df.sort_values(by= "visitas")

   nombre  especialidad  edad  visitas  sexo
1    True          True  True     True  True
0    True          True  True     True  True
4    True          True  True     True  True
6    True          True  True     True  True
2    True          True  True     True  True
5    True          True  True     True  True
3    True          True  True     True  True

## df.value_counts()

Mira, aquí como lo dice su nombre, lo que hacemos es hacer una cuenta de lo que hay de cada cosa

In [100]:
df.value_counts("edad")

edad
28    2
29    2
31    2
30    1
dtype: int64

## df.rename()

Otra cosa que podemos hacer es como su nombre dice, renombrar columnas, por ejemplo:

In [101]:
df.rename(columns = {"edad" : "viejo"})

           nombre         especialidad  viejo  visitas sexo
0       SFDX Show             Hardware     30   130855    H
1     Sara Nogark     Edición De Vídeo     29   114175    M
2    Nate Gentile         Programación     31   142545    H
3       Bettatech         Programación     31   149462    H
4  Antonio Sarosi  Sistemas Operativos     28   132008    H
5      Edgar Pons             Robótica     29   143620    H
6         s4vitar              Hacking     28   132567    H

# Funciones Avanzadas

Aquí lo que haremos fusionar 2 dataframes, con la misma cantidad de columnas, por ende para no batallar crearemos una copia del otro dataframe

In [215]:
df_nuevo = df.copy()

## pd.concat()

In [216]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición De Vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [217]:
df_nuevo

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición De Vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [218]:
df_nuevo["nombre"] = ["Batman", "Spiderman", "Catwoman", "Capitan America", "Thor", "Iron Man", "Loki"]

In [219]:
df_nuevo

            nombre         especialidad  edad  visitas sexo
0           Batman             Hardware    30   130855    H
1        Spiderman     Edición De Vídeo    29   114175    M
2         Catwoman         Programación    31   142545    H
3  Capitan America         Programación    31   149462    H
4             Thor  Sistemas Operativos    28   132008    H
5         Iron Man             Robótica    29   143620    H
6             Loki              Hacking    28   132567    H

In [107]:
pd.concat([df, df_nuevo])

            nombre         especialidad  edad  visitas sexo
0        SFDX Show             Hardware    30   130855    H
1      Sara Nogark     Edición De Vídeo    29   114175    M
2     Nate Gentile         Programación    31   142545    H
3        Bettatech         Programación    31   149462    H
4   Antonio Sarosi  Sistemas Operativos    28   132008    H
5       Edgar Pons             Robótica    29   143620    H
6          s4vitar              Hacking    28   132567    H
0           Batman             Hardware    30   130855    H
1        Spiderman     Edición De Vídeo    29   114175    M
2         Catwoman         Programación    31   142545    H
3  Capitan America         Programación    31   149462    H
4             Thor  Sistemas Operativos    28   132008    H
5         Iron Man             Robótica    29   143620    H
6             Loki              Hacking    28   132567    H

Como vemos hemos concatenado, pero esto es incorrecto el hecho de que concatenamos y el indice se repite, esto no debe pasar y debe corregirse

In [108]:
pd.concat([df, df_nuevo]).reset_index()

    index           nombre         especialidad  edad  visitas sexo
0       0        SFDX Show             Hardware    30   130855    H
1       1      Sara Nogark     Edición De Vídeo    29   114175    M
2       2     Nate Gentile         Programación    31   142545    H
3       3        Bettatech         Programación    31   149462    H
4       4   Antonio Sarosi  Sistemas Operativos    28   132008    H
5       5       Edgar Pons             Robótica    29   143620    H
6       6          s4vitar              Hacking    28   132567    H
7       0           Batman             Hardware    30   130855    H
8       1        Spiderman     Edición De Vídeo    29   114175    M
9       2         Catwoman         Programación    31   142545    H
10      3  Capitan America         Programación    31   149462    H
11      4             Thor  Sistemas Operativos    28   132008    H
12      5         Iron Man             Robótica    29   143620    H
13      6             Loki              Hacking    28   132567    H

ESTO es lo que debemos hacer para que quede de manera correcta, resetear el index y aparte decirle que borre el indice extra que se creará

In [223]:
pd.concat([df, df_nuevo]).reset_index(drop=True)

In [ ]:
df = pd.concat([df, df_nuevo]).reset_index(drop=True)

In [225]:
df

             nombre         especialidad  edad  visitas sexo
0         SFDX Show             Hardware    30   130855    H
1       Sara Nogark     Edición De Vídeo    29   114175    M
2      Nate Gentile         Programación    31   142545    H
3         Bettatech         Programación    31   149462    H
4    Antonio Sarosi  Sistemas Operativos    28   132008    H
5        Edgar Pons             Robótica    29   143620    H
6           s4vitar              Hacking    28   132567    H
7            Batman             Hardware    30   130855    H
8         Spiderman     Edición De Vídeo    29   114175    M
9          Catwoman         Programación    31   142545    H
10  Capitan America         Programación    31   149462    H
11             Thor  Sistemas Operativos    28   132008    H
12         Iron Man             Robótica    29   143620    H
13             Loki              Hacking    28   132567    H

## df.where()

Aquí suponiendo que buscamos todas las especialidades que sean programación

In [110]:
df.where(df["especialidad"]== "Programación")

         nombre  especialidad  edad   visitas sexo
0           NaN           NaN   NaN       NaN  NaN
1           NaN           NaN   NaN       NaN  NaN
2  Nate Gentile  Programación  31.0  142545.0    H
3     Bettatech  Programación  31.0  149462.0    H
4           NaN           NaN   NaN       NaN  NaN
5           NaN           NaN   NaN       NaN  NaN
6           NaN           NaN   NaN       NaN  NaN

Algo interesante que podemos hacer, es crear filtros, valores que contengan filtros para luego con where aplicar de varios

In [114]:
filtro1 = df["especialidad"] == "Programación"
filtro2 = df["visitas"] > 135000

In [115]:
df.where(filtro1 & filtro2)

         nombre  especialidad  edad   visitas sexo
0           NaN           NaN   NaN       NaN  NaN
1           NaN           NaN   NaN       NaN  NaN
2  Nate Gentile  Programación  31.0  142545.0    H
3     Bettatech  Programación  31.0  149462.0    H
4           NaN           NaN   NaN       NaN  NaN
5           NaN           NaN   NaN       NaN  NaN
6           NaN           NaN   NaN       NaN  NaN

Nos sirve, pero podemos pedirle que nos quite los datos que no aplican

In [116]:
df.where(filtro1 & filtro2).dropna()

         nombre  especialidad  edad   visitas sexo
2  Nate Gentile  Programación  31.0  142545.0    H
3     Bettatech  Programación  31.0  149462.0    H

## df.groupby()

In [117]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición De Vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [118]:
df.groupby("especialidad").sum()

                     edad  visitas
especialidad
Edición De Vídeo       29   114175
Hacking                28   132567
Hardware               30   130855
Programación           62   292007
Robótica               29   143620
Sistemas Operativos    28   132008

Aquí por ejemplo lo que le pedí es que me agrupe por especialidades, y sume todo lo numerico que existe en esa agrupación, por ejemplo me sumo la edad de todos los que son de edición de video, hacking, etc. y sus visitas igualmente

In [119]:
df.groupby("especialidad").sum()["visitas"]

especialidad
Edición De Vídeo       114175
Hacking                132567
Hardware               130855
Programación           292007
Robótica               143620
Sistemas Operativos    132008
Name: visitas, dtype: int64

Aquí le pedimos que nos traiga por sexo, los que tienen más de algo

In [120]:
df.groupby("sexo").max()

           nombre         especialidad  edad  visitas
sexo
H         s4vitar  Sistemas Operativos    31   149462
M     Sara Nogark     Edición De Vídeo    29   114175

In [121]:
df.groupby(["sexo", "especialidad"]).max()

                                  nombre  edad  visitas
sexo especialidad
H    Hacking                     s4vitar    28   132567
     Hardware                  SFDX Show    30   130855
     Programación           Nate Gentile    31   149462
     Robótica                 Edgar Pons    29   143620
     Sistemas Operativos  Antonio Sarosi    28   132008
M    Edición De Vídeo        Sara Nogark    29   114175

## pd.pivot_table()

Es como gropuby, pero transforma las listas

Aquí lo que por defecto hace, es traere los promedios de los valores numericos

In [122]:
pd.pivot_table(df, index= "sexo")

      edad   visitas
sexo
H     29.5  138509.5
M     29.0  114175.0

In [123]:
pd.pivot_table(df, index="sexo", columns="edad")

       visitas
edad        28        29        30        31
sexo
H     132287.5  143620.0  130855.0  146003.5
M          NaN  114175.0       NaN       NaN

In [124]:
pd.pivot_table(df, index=["sexo"], values=["nombre"], columns=["especialidad"], aggfunc=np.max)

                       nombre                                                \
especialidad Edición De Vídeo  Hacking   Hardware  Programación    Robótica
sexo
H                         NaN  s4vitar  SFDX Show  Nate Gentile  Edgar Pons
M                 Sara Nogark      NaN        NaN           NaN         NaN


especialidad Sistemas Operativos
sexo
H                 Antonio Sarosi
M                            NaN

Lo que hicimos fue crear una pivot table que nos traiga por sexo y especialidad, las personas que mejor valores tienene osea en máximo

# Fechas

## Creando Fechas

In [228]:
df.head()

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición De Vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H

In [227]:
len(df)

14

Nosotros al ver que la longitud de mi data frame es de 14, vamos a generar 14 fechas, para este caso haremos que ponga del primero de enero al 1 de marzo, osea 14 meses

In [234]:
pd.date_range(start= "1 January 2021", end= "1 February 2022", freq= "MS")

DatetimeIndex(['2021-01-01', '2021-02-01', '2021-03-01', '2021-04-01',
               '2021-05-01', '2021-06-01', '2021-07-01', '2021-08-01',
               '2021-09-01', '2021-10-01', '2021-11-01', '2021-12-01',
               '2022-01-01', '2022-02-01'],
              dtype='datetime64[ns]', freq='MS')

In [235]:
fecha = pd.date_range(start= "1 January 2021", end= "1 February 2022", freq= "MS")

"M": Te lo hace mensiual y te trae el fin de cada mes
Pero aquí como queremos el principio 
sería con: "MS"

In [232]:
fecha[0]

Timestamp('2021-01-01 00:00:00', freq='MS')

In [237]:
df.set_index(fecha) #Si pones fechas de más o de menos, nos mandará error, tiene que ser exactamente
# La cantidad de fechas que la del data frame

                     nombre         especialidad  edad  visitas sexo
2021-01-01        SFDX Show             Hardware    30   130855    H
2021-02-01      Sara Nogark     Edición De Vídeo    29   114175    M
2021-03-01     Nate Gentile         Programación    31   142545    H
2021-04-01        Bettatech         Programación    31   149462    H
2021-05-01   Antonio Sarosi  Sistemas Operativos    28   132008    H
2021-06-01       Edgar Pons             Robótica    29   143620    H
2021-07-01          s4vitar              Hacking    28   132567    H
2021-08-01           Batman             Hardware    30   130855    H
2021-09-01        Spiderman     Edición De Vídeo    29   114175    M
2021-10-01         Catwoman         Programación    31   142545    H
2021-11-01  Capitan America         Programación    31   149462    H
2021-12-01             Thor  Sistemas Operativos    28   132008    H
2022-01-01         Iron Man             Robótica    29   143620    H
2022-02-01             Loki              Hacking    28   132567    H

Como vimos nos agrego la fecha pero no sabe lo que es, solo lo agregó, para eso tenemos que agregar nosotros el valor como es

In [238]:
df.set_index(pd.DatetimeIndex(fecha), inplace=True)

In [239]:
df

                     nombre         especialidad  edad  visitas sexo
2021-01-01        SFDX Show             Hardware    30   130855    H
2021-02-01      Sara Nogark     Edición De Vídeo    29   114175    M
2021-03-01     Nate Gentile         Programación    31   142545    H
2021-04-01        Bettatech         Programación    31   149462    H
2021-05-01   Antonio Sarosi  Sistemas Operativos    28   132008    H
2021-06-01       Edgar Pons             Robótica    29   143620    H
2021-07-01          s4vitar              Hacking    28   132567    H
2021-08-01           Batman             Hardware    30   130855    H
2021-09-01        Spiderman     Edición De Vídeo    29   114175    M
2021-10-01         Catwoman         Programación    31   142545    H
2021-11-01  Capitan America         Programación    31   149462    H
2021-12-01             Thor  Sistemas Operativos    28   132008    H
2022-01-01         Iron Man             Robótica    29   143620    H
2022-02-01             Loki              Hacking    28   132567    H

In [242]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 14 entries, 2021-01-01 to 2022-02-01
Freq: MS
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   nombre        14 non-null     object
 1   especialidad  14 non-null     object
 2   edad          14 non-null     int64
 3   visitas       14 non-null     int64
 4   sexo          14 non-null     object
dtypes: int64(2), object(3)
memory usage: 672.0+ bytes

Como vemos, se nos puede ser confuso ese formato de fecha, lo podemos modificar para hacerlo a lo convencional

In [244]:
df.index

DatetimeIndex(['2021-01-01', '2021-02-01', '2021-03-01', '2021-04-01',
               '2021-05-01', '2021-06-01', '2021-07-01', '2021-08-01',
               '2021-09-01', '2021-10-01', '2021-11-01', '2021-12-01',
               '2022-01-01', '2022-02-01'],
              dtype='datetime64[ns]', freq='MS')

In [245]:
formato = "%d/%m/%Y"

In [246]:
df.index.strftime(formato)

Index(['01/01/2021', '01/02/2021', '01/03/2021', '01/04/2021', '01/05/2021',
       '01/06/2021', '01/07/2021', '01/08/2021', '01/09/2021', '01/10/2021',
       '01/11/2021', '01/12/2021', '01/01/2022', '01/02/2022'],
      dtype='object')

In [247]:
df.index = df.index.strftime(formato)

In [248]:
df

                     nombre         especialidad  edad  visitas sexo
01/01/2021        SFDX Show             Hardware    30   130855    H
01/02/2021      Sara Nogark     Edición De Vídeo    29   114175    M
01/03/2021     Nate Gentile         Programación    31   142545    H
01/04/2021        Bettatech         Programación    31   149462    H
01/05/2021   Antonio Sarosi  Sistemas Operativos    28   132008    H
01/06/2021       Edgar Pons             Robótica    29   143620    H
01/07/2021          s4vitar              Hacking    28   132567    H
01/08/2021           Batman             Hardware    30   130855    H
01/09/2021        Spiderman     Edición De Vídeo    29   114175    M
01/10/2021         Catwoman         Programación    31   142545    H
01/11/2021  Capitan America         Programación    31   149462    H
01/12/2021             Thor  Sistemas Operativos    28   132008    H
01/01/2022         Iron Man             Robótica    29   143620    H
01/02/2022             Loki              Hacking    28   132567    H